In [1]:
try:
    import pandas as pd
    import numpy as np
    import matplotlib.pyplot as plt
    import requests
    from sklearn.model_selection import train_test_split
    from sklearn.model_selection import StratifiedShuffleSplit
    import category_encoders as ce
except ImportError as e:
    print(e)

# read data

In [2]:
df = pd.read_csv(r"Datasets\flight_data.csv",index_col=0)
df

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955
...,...,...,...,...,...,...,...,...,...,...,...
300148,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,69265
300149,Vistara,UK-826,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,49,77105
300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,49,79099
300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,49,81585
300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,81585

In [3]:
df.describe()

            duration      days_left          price
count  300153.000000  300153.000000  300153.000000
mean       12.221021      26.004751   20889.660523
std         7.191997      13.561004   22697.767366
min         0.830000       1.000000    1105.000000
25%         6.830000      15.000000    4783.000000
50%        11.250000      26.000000    7425.000000
75%        16.170000      38.000000   42521.000000
max        49.830000      49.000000  123071.000000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 300153 entries, 0 to 300152
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   airline           300153 non-null  object
 1   flight            300153 non-null  object
 2   source_city       300153 non-null  object
 3   departure_time    300153 non-null  object
 4   stops             300153 non-null  object
 5   arrival_time      300153 non-null  object
 6   destination_city  300153 non-null  object
 7   class             300153 non-null  object
 8   duration          300153 non-null  float64
 9   days_left         300153 non-null  int64
 10  price             300153 non-null  int64
dtypes: float64(1), int64(2), object(8)
memory usage: 27.5+ MB

In [5]:
df.shape

(300153, 11)

In [6]:
df.isna().sum()

airline             0
flight              0
source_city         0
departure_time      0
stops               0
arrival_time        0
destination_city    0
class               0
duration            0
days_left           0
price               0
dtype: int64

In [7]:
df.nunique()

airline                 6
flight               1561
source_city             6
departure_time          6
stops                   3
arrival_time            6
destination_city        6
class                   2
duration              476
days_left              49
price               12157
dtype: int64

In [8]:
df

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955
...,...,...,...,...,...,...,...,...,...,...,...
300148,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,69265
300149,Vistara,UK-826,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,49,77105
300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,49,79099
300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,49,81585
300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,81585

In [9]:
df['stops'].unique()

array(['zero', 'one', 'two_or_more'], dtype=object)

In [10]:
stops_mapping = {'zero': 0,'one': 1,'two_or_more': 2}
df['stops'] = df['stops'].replace(stops_mapping).astype(int)
df

C:\Users\HARSH\AppData\Local\Temp\ipykernel_10936\2860118281.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['stops'] = df['stops'].replace(stops_mapping).astype(int)

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,SpiceJet,SG-8709,Delhi,Evening,0,Night,Mumbai,Economy,2.17,1,5953
1,SpiceJet,SG-8157,Delhi,Early_Morning,0,Morning,Mumbai,Economy,2.33,1,5953
2,AirAsia,I5-764,Delhi,Early_Morning,0,Early_Morning,Mumbai,Economy,2.17,1,5956
3,Vistara,UK-995,Delhi,Morning,0,Afternoon,Mumbai,Economy,2.25,1,5955
4,Vistara,UK-963,Delhi,Morning,0,Morning,Mumbai,Economy,2.33,1,5955
...,...,...,...,...,...,...,...,...,...,...,...
300148,Vistara,UK-822,Chennai,Morning,1,Evening,Hyderabad,Business,10.08,49,69265
300149,Vistara,UK-826,Chennai,Afternoon,1,Night,Hyderabad,Business,10.42,49,77105
300150,Vistara,UK-832,Chennai,Early_Morning,1,Night,Hyderabad,Business,13.83,49,79099
300151,Vistara,UK-828,Chennai,Early_Morning,1,Evening,Hyderabad,Business,10.00,49,81585
300152,Vistara,UK-822,Chennai,Morning,1,Evening,Hyderabad,Business,10.08,49,81585

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 300153 entries, 0 to 300152
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   airline           300153 non-null  object
 1   flight            300153 non-null  object
 2   source_city       300153 non-null  object
 3   departure_time    300153 non-null  object
 4   stops             300153 non-null  int64
 5   arrival_time      300153 non-null  object
 6   destination_city  300153 non-null  object
 7   class             300153 non-null  object
 8   duration          300153 non-null  float64
 9   days_left         300153 non-null  int64
 10  price             300153 non-null  int64
dtypes: float64(1), int64(3), object(7)
memory usage: 27.5+ MB

In [12]:
encoder= ce.BaseNEncoder(cols=["source_city",'destination_city'],return_df=True,base=5)

In [13]:
data_encoded=encoder.fit_transform(df)
data_encoded

,airline,flight,source_city_0,source_city_1,departure_time,stops,arrival_time,destination_city_0,destination_city_1,class,duration,days_left,price
0,SpiceJet,SG-8709,0,1,Evening,0,Night,0,1,Economy,2.17,1,5953
1,SpiceJet,SG-8157,0,1,Early_Morning,0,Morning,0,1,Economy,2.33,1,5953
2,AirAsia,I5-764,0,1,Early_Morning,0,Early_Morning,0,1,Economy,2.17,1,5956
3,Vistara,UK-995,0,1,Morning,0,Afternoon,0,1,Economy,2.25,1,5955
4,Vistara,UK-963,0,1,Morning,0,Morning,0,1,Economy,2.33,1,5955
...,...,...,...,...,...,...,...,...,...,...,...,...,...
300148,Vistara,UK-822,1,1,Morning,1,Evening,0,4,Business,10.08,49,69265
300149,Vistara,UK-826,1,1,Afternoon,1,Night,0,4,Business,10.42,49,77105
300150,Vistara,UK-832,1,1,Early_Morning,1,Night,0,4,Business,13.83,49,79099
300151,Vistara,UK-828,1,1,Early_Morning,1,Evening,0,4,Business,10.00,49,81585
300152,Vistara,UK-822,1,1,Morning,1,Evening,0,4,Business,10.08,49,81585

In [14]:
data_encoded=encoder.fit_transform(df)
data_encoded

,airline,flight,source_city_0,source_city_1,departure_time,stops,arrival_time,destination_city_0,destination_city_1,class,duration,days_left,price
0,SpiceJet,SG-8709,0,1,Evening,0,Night,0,1,Economy,2.17,1,5953
1,SpiceJet,SG-8157,0,1,Early_Morning,0,Morning,0,1,Economy,2.33,1,5953
2,AirAsia,I5-764,0,1,Early_Morning,0,Early_Morning,0,1,Economy,2.17,1,5956
3,Vistara,UK-995,0,1,Morning,0,Afternoon,0,1,Economy,2.25,1,5955
4,Vistara,UK-963,0,1,Morning,0,Morning,0,1,Economy,2.33,1,5955
...,...,...,...,...,...,...,...,...,...,...,...,...,...
300148,Vistara,UK-822,1,1,Morning,1,Evening,0,4,Business,10.08,49,69265
300149,Vistara,UK-826,1,1,Afternoon,1,Night,0,4,Business,10.42,49,77105
300150,Vistara,UK-832,1,1,Early_Morning,1,Night,0,4,Business,13.83,49,79099
300151,Vistara,UK-828,1,1,Early_Morning,1,Evening,0,4,Business,10.00,49,81585
300152,Vistara,UK-822,1,1,Morning,1,Evening,0,4,Business,10.08,49,81585